{
  "backend/main.mo": "Motoko actor managing blog posts (with view counts) and updates, exposing admin-only write functions and public read functions for top posts and recent updates, with access control via a mixin.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their source files, component dependencies, test IDs, and confidence levels for the EchoFactyt project.",
  "frontend-file-summaries.txt": "JSON document containing one-line summaries of each frontend source file, describing the purpose of every component, hook, and style file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes, covering background, foreground, card, border, and chart color tokens.",
  "frontend/index.html": "Minimal HTML shell for the React SPA, setting the page title to 'EchoFactyt' and mounting the app at the #root div.",
  "frontend/src/App.tsx": "Root React component that composes the full page layout by rendering all sections (Hero, Updates, CategoryFilter, TrendingFacts, PopularPosts, Top10, Guides, Videos, Quiz, Calculators, Downloads) with shared category filter state.",
  "frontend/src/components/CalculatorsSection.tsx": "Section wrapper that renders the GPA Calculator and Screen Time Calculator side-by-side in a two-column responsive grid with a section heading.",
  "frontend/src/components/CategoryFilter.tsx": "Sticky horizontal pill-button filter bar allowing users to filter content by category (All, Technology, School, Health, Entertainment, Daily Life) with active state styling.",
  "frontend/src/components/DownloadsSection.tsx": "Free downloads section rendering six FreebieCard components (Study Planner, Meal Prep Checklist, Habit Tracker, etc.) in a responsive three-column grid.",
  "frontend/src/components/FactCard.tsx": "Renders a styled card displaying a single fact with category badge, title, fact text, and share buttons, with per-category color theming and accent bars.",
  "frontend/src/components/Footer.tsx": "Site footer with brand logo, social media links, an explore navigation list, and a newsletter email signup form on a dark background.",
  "frontend/src/components/FreebieCard.tsx": "Card component for a downloadable freebie item that shows a temporary 'Coming Soon' confirmation state when the download button is clicked.",
  "frontend/src/components/GPACalculator.tsx": "Interactive GPA calculator allowing users to add/remove courses with grade and credit inputs, displaying a live-calculated GPA with a color-coded label.",
  "frontend/src/components/GuideCard.tsx": "Displays a step-by-step guide card with a colored header, numbered steps list, and share buttons at the bottom.",
  "frontend/src/components/GuidesSection.tsx": "Section component that renders a filterable grid of GuideCard components from a hardcoded list of step-by-step guides across multiple categories.",
  "frontend/src/components/Header.tsx": "Sticky site header with the EchoFactyt logo, desktop navigation links with smooth-scroll behavior, and a collapsible mobile menu.",
  "frontend/src/components/HeroSection.tsx": "Renders the landing page hero section with a background image, gradient overlay, tagline, CTA buttons (Learn More, Try Now, Watch Video), and a stats row showing site metrics.",
  "frontend/src/components/NewUpdatesSection.tsx": "Displays a grid of recently added facts/tips fetched via useGetRecentUpdates, showing relative timestamps and a 'New' badge, with skeleton loading states.",
  "frontend/src/components/PopularPostsSection.tsx": "Shows the top posts ranked by view count using useGetTopPosts, and increments a post's view count via useViewPost when a card is clicked.",
  "frontend/src/components/Quiz.tsx": "A multi-step study-habits quiz with 6 scored questions that calculates a final result tier and displays a share button and reset option on completion.",
  "frontend/src/components/QuizSection.tsx": "A section wrapper that renders the Quiz component with a heading and subtitle inside a styled container.",
  "frontend/src/components/ScreenTimeCalculator.tsx": "An interactive screen time tracker with sliders for phone, computer, TV, and gaming hours that computes a total and displays a wellness assessment label and advice.",
  "frontend/src/components/ShareButtons.tsx": "Renders share buttons for X, Facebook, WhatsApp, and a copy-link button, encoding the provided title and URL for each platform.",
  "frontend/src/components/Top10ListCard.tsx": "Displays a styled top-10 list card with a colored header, numbered items, an expand/collapse toggle for items beyond the first five, and a 'Try Now' button.",
  "frontend/src/components/Top10Section.tsx": "Renders a 'Top 10 Lists' section with hardcoded curated lists across categories (School, Technology, Health, Daily Life), filtered by a selected category prop and displayed using Top10ListCard components.",
  "frontend/src/components/TrendingFactsSection.tsx": "Renders a 'Trending Facts' section with hardcoded mind-blowing facts across multiple categories, filtered by a selected category prop and displayed in a responsive grid of FactCard components.",
  "frontend/src/components/VideoCard.tsx": "A card component that displays a YouTube video thumbnail with a play button, switching to an embedded iframe player on click, along with a category badge and title.",
  "frontend/src/components/VideosSection.tsx": "Renders a 'Watch & Learn' section with a hardcoded list of YouTube videos displayed as a responsive grid of VideoCard components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching top posts, recording post views, and fetching recent updates from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS, defines OKLCH-based CSS custom properties for light/dark themes, and declares utility classes for gradients, badges, card hover effects, and layout.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider for data fetching and InternetIdentityProvider for authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a custom design system with OKLCH-based brand colors (coral, teal, amber), custom fonts (Nunito, Poppins), extended border radii, box shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest for EchoFactyt, a youth-focused facts/tips website, tracking schema version, architectural notes, existing features, and image requirements."
}